; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	thermograph2 - mode
	spectrograph0 - mode
	image1 - mode
	image3 - mode
	Star3 - direction
	Star1 - direction
	GroundStation2 - direction
	Star4 - direction
	Star0 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star1)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 image1)
	(supports instrument2 thermograph2)
	(supports instrument2 image3)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
	(supports instrument3 thermograph2)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star0)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
)
(:goal (and
	(pointing satellite0 Phenomenon5)
	(have_image Phenomenon5 thermograph2)
	(have_image Phenomenon6 image3)
	(have_image Planet7 spectrograph0)
	(have_image Star8 spectrograph0)
	(have_image Phenomenon9 spectrograph0)
))

)

; plan
1. (turn_to satellite1 star0 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star0)
   goals met: 0 of 6
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 6
3. (calibrate satellite1 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 0 of 6
4. (turn_to satellite1 phenomenon9 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon9)
   goals met: 0 of 6
5. (turn_to satellite0 star4 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star4)
   goals met: 0 of 6
6. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 6
7. (calibrate satellite0 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 0 of 6
8. (take_image satellite1 phenomenon9 instrument3 spectrograph0)
   added: (have_image phenomenon9 spectrograph0)
   goals met: 1 of 6
9. (turn_to satellite0 phenomenon6 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon6)
   goals met: 1 of 6
10. (take_image satellite0 phenomenon6 instrument2 image3)
   added: (have_image phenomenon6 image3)
   goals met: 2 of 6
11. (turn_to satellite0 phenomenon5 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon5)
   goals met: 3 of 6
12. (take_image satellite0 phenomenon5 instrument2 thermograph2)
   added: (have_image phenomenon5 thermograph2)
   goals met: 4 of 6
13. (turn_to satellite1 planet7 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet7)
   goals met: 4 of 6
14. (take_image satellite1 planet7 instrument3 spectrograph0)
   added: (have_image planet7 spectrograph0)
   goals met: 5 of 6
15. (turn_to satellite1 star8 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star8)
   goals met: 5 of 6
16. (take_image satellite1 star8 instrument3 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 6 of 6
